# One to Many and Many to Many Joins


## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

## Objectives 

You will be able to:

* Query data using one-to-many and many-to-many joins
* Predict the resulting size of one-to-many and many-to-many joins


<img src='Database-Schema.png' width=550>

## Connect to the Database

In [2]:
import sqlite3
import pandas as pd

In [3]:
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [5]:
# Your code here
cur.execute("""select firstName, lastName, city, state
                        from employees e
                        join offices o
                        using(officeCode);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
print('Number of results', len(df))
df.head()

Number of results 23

  firstName   lastName           city state
0     Diane     Murphy  San Francisco    CA
1      Mary  Patterson  San Francisco    CA
2      Jeff   Firrelli  San Francisco    CA
3   William  Patterson         Sydney
4    Gerard     Bondur          Paris

## Customers and their Orders (a One-to-Many join)

Return a list of customers first and last names along with each of their order numbers, order dates and statuses.

In [7]:
#Your code here
cur.execute("""select contactFirstName, contactLastName,
                      orderNumber, orderDate, status
                      from customers
                      join orders
                      using(customerNumber);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
print('Number of results', len(df))
df.head()

Number of results 326

  contactFirstName contactLastName orderNumber   orderDate   status
0          Carine          Schmitt       10123  2003-05-20  Shipped
1          Carine          Schmitt       10298  2004-09-27  Shipped
2          Carine          Schmitt       10345  2004-11-25  Shipped
3             Jean            King       10124  2003-05-21  Shipped
4             Jean            King       10278  2004-08-06  Shipped

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of customer first and last names, product names, quantities, and date ordered for each of the customers and each of their orders. 

Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [10]:
#Your code here
cur.execute("""select contactFirstName, contactLastName,
                      productName, quantityOrdered, orderDate
                      from customers c
                      join orders o
                      using(customerNumber)
                      join orderdetails od
                      using(orderNumber)
                      join products p 
                      using (productCode);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
print('Number of results', len(df))
df.head()

Number of results 2996

,contactFirstName,contactLastName,productName,quantityOrdered,orderDate
0,Carine,Schmitt,1965 Aston Martin DB5,26,2003-05-20
1,Carine,Schmitt,1999 Indy 500 Monte Carlo SS,46,2003-05-20
2,Carine,Schmitt,1948 Porsche Type 356 Roadster,34,2003-05-20
3,Carine,Schmitt,1966 Shelby Cobra 427 S/C,50,2003-05-20
4,Carine,Schmitt,1996 Moto Guzzi 1100i,39,2004-09-27

## Summary

In this lab, you practiced your knowledge on One-to-Many and Many-to-many relationships!